# Order data of mexican style franchise chipotle data analysis

## data analysis overview
### What is most popular menu?

We have to summarize question list like below
- What are the top 10 of most sold menus?
- How much of sales count for each menu?
- How much price range of each menu?

I will solve this problem by python and SQL at the same time.  
First, i wil write by Python like book and second i will write by SQL(MySQL v8.0)

In [3]:
# for connect MySQL
import pymysql
conn = pymysql.connect(host='localhost', port=3306, user='data_analysis_book', passwd='D@taanalysis1', db='this_is_data_analysis', charset='utf8')

# Show data information

In [1]:
# data load and show information of chipotle
import pandas as pd
file_path = '../data/chipotle.tsv'
chipotle_data = pd.read_csv(file_path, sep='\t')

print(f'Chipo.shape >> {chipotle_data.shape}')
print('----')
print('Chipo data information')
print(chipotle_data.info())

Chipo.shape >> (4622, 5)
----
Chipo data information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB
None

Chipotle data has 4,622 rows and 5 features(columns).  
In chipotle_data.info() we can know like as below:
- Feature name which name is 'choice_description' has 1,246(4,622 - 3,376) missing values.
- 'order_id', 'quantity' types is integer.
- 'choice_description', 'item_name', 'item_price' types is string.

In [5]:
# show 10 row order by dataframe index
chipotle_data.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [6]:
print(f'Columns : {chipotle_data.columns}')
print(f'Index : {chipotle_data.index}')

Columns : Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')
Index : RangeIndex(start=0, stop=4622, step=1)

Chipo data's feature meaning:
- order_id : order number(can duplicate because it means customers order's id(one customer can order lots of thing)
- quantity : quantity of ordered item
- item_name : name of ordered item
- choice_description : detail selected option of ordered item
- item_price : price of ordered item

**Numerical character of quantity and item_price**  
- Both features are continuous features.
    - Continuous feature means it can get any value shape of continuous number like heights, weights.
- We can get basic statistics by describe()
    - Function which name is describe, gives only quantity's information because numerical feature is only quantity
    - order_id is numerical too, but it is number to seperate order.
    - item_price is string value in this data.

In [7]:
# change order_id to string because it didn't have numerical meaning
# we don't change sql data to string(it will be dangerous)
chipotle_data['order_id'] = chipotle_data['order_id'].astype(str)
chipotle_data.describe()

          quantity
count  4622.000000
mean      1.075725
std       0.410186
min       1.000000
25%       1.000000
50%       1.000000
75%       1.000000
max      15.000000

In [12]:
# Blog said it need set group_concat_max_len =10485760
# https://using.tistory.com/91
# To do : Change query to get quantile

query_for_describe = """
select
    count(quantity) as "count",
    avg(quantity) as "mean",
    std(quantity) as "std",
    min(quantity) as "min",
    substring_index(substring_index(group_concat(quantity order by quantity separator  ','), ',', 0.25*count(*) + 1), ',' , -1) as "25%",
    substring_index(substring_index(group_concat(quantity order by quantity separator  ','), ',', 0.5*count(*) + 1), ',' , -1) as "median",
    substring_index(substring_index(group_concat(quantity order by quantity separator  ','), ',', 0.75*count(*) + 1), ',' , -1) as "75%",
    max(quantity) as "max"
from chipotle"""
describe_result = pd.read_sql(query_for_describe, conn)
describe_result.T

               0
count       4622
mean      1.0757
std     0.410142
min            1
25%
median
75%
max           15

We can get insight by describe as below:
- Average of quantity is 1.07.
    - It means "Almost customers ordered 1 item for 1 menu.".
    - We can get insight like "There are not many cases where one person purchases multiple items of the same menu.".

**Number of order_id, item_name**  
We can get as below:

In [14]:
print(len(chipotle_data['order_id'].unique()))
print(len(chipotle_data['item_name'].unique()))

1834
50

In [19]:
cur = conn.cursor()
query_for_order_id_cnt = "select count(distinct order_id) from chipotle;"
cur.execute(query_for_order_id_cnt)
print(cur.fetchmany(1))
query_for_item_name_cnt = "select count(distinct item_name) from chipotle;"
cur.execute(query_for_item_name_cnt)
print(cur.fetchmany(1))
cur.close()

((1834,),)
((50,),)